package main.HW2.Number2_3;

/*Написать программу которая будет генерировать пирамидку. */

public class main {

    public static void main(String[] args) {
        Pyramid first = new Pyramid();
        System.out.println(first.pir(10));
    }
}
